# NemAll_Python_Precast

**Modul:** `NemAll_Python_Precast`
**Import:** `import NemAll_Python_Precast as AllplanPrecast`
**Seit:** Allplan 2026
**Status:** ✅ VERIFIED

Verifizierter Klassenkatalog aus `api_reference/InterfaceStubs/NemAll_Python_Precast/`.

| Klasse | Status | Quelle |
|---|---|---|
| `AlignmentProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/AlignmentProperties/index.html` |
| `AllowedElements` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/AllowedElements/index.html` |
| `Anchor` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Anchor/index.html` |
| `AnchorBorderPosition` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/AnchorBorderPosition/index.html` |
| `AssemblyGroupElement` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/AssemblyGroupElement/index.html` |
| `Cell` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Cell/index.html` |
| `ClippingPathProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/ClippingPathProperties/index.html` |
| `DimensioningProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/DimensioningProperties/index.html` |
| `Direction` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Direction/index.html` |
| `DirectionMode` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/DirectionMode/index.html` |
| `DirectionProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/DirectionProperties/index.html` |
| `FileEntryPath` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FileEntryPath/index.html` |
| `FinishProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FinishProperties/index.html` |
| `FixtureCombinationType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureCombinationType/index.html` |
| `FixtureElement` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureElement/index.html` |
| `FixtureGroupElement` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureGroupElement/index.html` |
| `FixtureGroupProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureGroupProperties/index.html` |
| `FixturePlacementElement` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixturePlacementElement/index.html` |
| `FixturePlacementProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixturePlacementProperties/index.html` |
| `FixtureProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureProperties/index.html` |
| `FixtureSlideElement` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureSlideElement/index.html` |
| `FixtureSlideProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureSlideProperties/index.html` |
| `FixtureSlideType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureSlideType/index.html` |
| `FixtureSlideViewType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FixtureSlideViewType/index.html` |
| `FormatProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/FormatProperties/index.html` |
| `HeadingProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/HeadingProperties/index.html` |
| `HeightDefinitionType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/HeightDefinitionType/index.html` |
| `LabelingProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/LabelingProperties/index.html` |
| `LabelStyle` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/LabelStyle/index.html` |
| `LabelStyleProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/LabelStyleProperties/index.html` |
| `Legend` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Legend/index.html` |
| `LegendProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/LegendProperties/index.html` |
| `LightProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/LightProperties/index.html` |
| `LineProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/LineProperties/index.html` |
| `Location` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Location/index.html` |
| `MacroGroupType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/MacroGroupType/index.html` |
| `MacroSubType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/MacroSubType/index.html` |
| `MacroType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/MacroType/index.html` |
| `OutlineShape` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/OutlineShape/index.html` |
| `OutlineType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/OutlineType/index.html` |
| `OutlineTypeInGroup` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/OutlineTypeInGroup/index.html` |
| `Page` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Page/index.html` |
| `PageProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/PageProperties/index.html` |
| `PagePropertiesList` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/PagePropertiesList/index.html` |
| `Plan` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Plan/index.html` |
| `Position` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Position/index.html` |
| `PrecastElement` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/PrecastElement/index.html` |
| `PrecastElementProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/PrecastElementProperties/index.html` |
| `PrecastLayer` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/PrecastLayer/index.html` |
| `PrecastLayerProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/PrecastLayerProperties/index.html` |
| `PrecastMWSElement` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/PrecastMWSElement/index.html` |
| `PrecastProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/PrecastProperties/index.html` |
| `ProfilType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/ProfilType/index.html` |
| `RepresentationProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/RepresentationProperties/index.html` |
| `Rotation` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Rotation/index.html` |
| `ScaleProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/ScaleProperties/index.html` |
| `SectionProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/SectionProperties/index.html` |
| `SubType` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/SubType/index.html` |
| `SurfaceProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/SurfaceProperties/index.html` |
| `TextAlignment` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/TextAlignment/index.html` |
| `TextParameters` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/TextParameters/index.html` |
| `TextProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/TextProperties/index.html` |
| `Type` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/Type/index.html` |
| `View` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/View/index.html` |
| `ViewProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/ViewProperties/index.html` |
| `VisibilityProperties` | ✅ VERIFIED | `api_reference/InterfaceStubs/NemAll_Python_Precast/VisibilityProperties/index.html` |

⚠️ Hinweise:
- Diese Datei erfasst den verifizierten Klassenbestand des Moduls.
- Methoden-/Signaturdetails muessen pro Klasse aus der jeweiligen Klassenseite extrahiert werden.